<template>
  <div class="login">
    <div class="login_head">
      <svg viewBox="0 0 1024 1024" xmlns="http://www.w3.org/2000/svg">
        <path d="M901.12 579.584c-20.48-40.96-34.816-83.968-65.536-120.832-16.384-16.384-38.912-22.528-60.62-22.733-2.663.82-2.868 5.12-2.049 7.578 2.253 8.192-3.481 16.179-9.625 21.913-6.144 5.735-13.312 11.47-15.156 19.661-1.228 5.325 0 11.264-2.867 15.77-1.638 2.457-4.3 4.096-6.758 5.734-15.155 8.602-31.744 14.131-47.719 21.095-78.438 33.587-142.336 97.28-223.846 122.265-8.602 2.663-20.07 7.373-26.42 1.024-10.24-10.24-28.671-6.144-30.72 6.144l-1.228 4.915c7.578 27.648 21.914 52.43 38.707 75.367 1.434.41 2.867 1.229 4.096 2.662 7.987 7.987 15.36 16.589 23.347 24.781l1.434 1.434c9.42 6.553 19.456 12.492 29.696 17.817 59.392 24.576 120.832 18.432 184.32 30.72 30.72 6.144 57.344 16.384 83.968 34.816 10.24 6.144 24.576 16.384 36.864 6.144 0-12.288-2.048-26.624-4.096-38.912 0-16.384-4.096-34.816 10.24-49.152 18.432-18.432 38.912-32.768 55.296-53.248 12.288-16.384 22.528-32.768 30.72-51.2 10.24-26.419 12.288-57.139-2.048-83.763z" fill="#DBF083" />
        <path d="M731.136 286.106l-77.21-73.524L512 159.744H378.06l-138.649 58.778-84.992 90.726-16.793 107.93 9.83 52.633 40.55 63.693 62.464 66.15 22.119 24.576v39.322l-24.576 41.78 8.601 22.118 34.407-14.746 74.752-36.864 52.633-28.262L512 642.662l83.149-7.372 100.557-63.079 57.548-101.171 15.975-106.7-38.093-78.234zm-10.445 114.688c-11.469 122.675-128 185.753-236.134 212.172-12.903 3.072-18.227-16.588-5.53-19.66 97.895-23.757 210.74-79.668 221.184-192.308 1.229-13.312 21.709-13.312 20.48-.204z" fill="#7EC3FC" />
        <path d="M262.963 748.954c-6.758 0-13.517-2.253-19.251-6.759-9.83-7.782-13.926-20.48-10.445-32.563 1.229-4.506 2.663-9.216 4.096-13.926 6.144-21.504 17.203-60.416 15.565-73.728-87.245-50.176-139.264-131.072-139.264-217.293 0-147.661 150.528-267.674 335.462-267.674S784.384 257.23 784.384 404.685 633.856 672.358 448.922 672.358c-13.517 0-27.239-.614-40.756-2.048-10.854.41-50.176 25.396-76.39 41.984-18.227 11.47-37.069 23.348-53.862 32.564-4.71 2.662-9.83 4.096-14.95 4.096zM448.922 177.97c-162.407 0-294.503 101.581-294.503 226.714 0 72.294 45.466 140.697 121.856 183.5 27.853 15.565 17.613 58.164 3.277 108.545 10.035-6.144 20.48-12.698 30.72-19.047 50.79-32.153 80.486-50.176 102.195-47.923 12.083 1.229 24.576 1.638 36.66 1.638 162.406 0 294.502-101.58 294.502-226.713-.205-124.928-132.301-226.714-294.707-226.714z" fill="#888" />
        <path d="M923.443 616.243c0-58.982-30.925-115.302-84.992-155.033-9.216-6.759-21.913-4.71-28.672 4.505-6.758 9.216-4.71 21.914 4.506 28.672 44.032 32.359 68.198 75.571 68.198 121.856 0 53.658-33.997 104.448-90.726 136.397-22.119 12.288-17.613 41.574-7.987 76.8l-13.108-8.192c-39.936-25.19-63.078-39.117-81.305-37.478-9.011.819-18.432 1.228-27.648 1.228-74.343 0-143.36-28.467-184.525-76.39-7.373-8.602-20.275-9.42-28.877-2.253-8.601 7.373-9.42 20.275-2.048 28.877.82 1.024 1.843 2.048 2.663 3.072.819.41 1.638 1.024 2.457 1.843 4.506 4.506 8.807 9.216 13.312 13.927 49.357 45.26 121.037 71.68 197.223 71.68 10.24 0 20.684-.41 30.72-1.434 9.216 1.638 37.478 19.456 56.32 31.334 14.13 8.807 28.467 18.023 41.574 25.19 4.3 2.458 9.216 3.687 13.926 3.687 6.35 0 12.493-2.048 17.613-6.349 9.011-7.168 12.903-19.046 9.83-29.9-1.023-3.482-2.047-7.168-3.071-10.855-4.096-14.745-11.674-40.96-11.879-52.224 66.765-39.117 106.496-101.99 106.496-168.96z" fill="#888" />
      </svg>
      {{ title }}
    </div>
    <div class="login_form">
      <div class="login_form__item">
        <div class="login_form__item--label">您的 QQ</div>
        <input class="login_form__item--value" maxlength="10" v-model="currentUser.qq" placeholder="输入您的 QQ 号" />
      </div>
      <div class="login_form__item">
        <div class="login_form__item--label">您的昵称</div>
        <input class="login_form__item--value" maxlength="6" v-model="currentUser.nick" placeholder="输入您的昵称" />
      </div>

    </div>
    <div class="login_submit" @click="login">
      立 即 登 录
    </div>
  </div>
</template>

<script>
import { isQQ } from '@vbs/utils';
import { title } from '../config';
export default {
  data() {
    return {
      title,
      currentUser: {
        qq: '',
        id: `${Math.floor(Math.random() * (99999 - 10000) + 10000)}`,
        nick: '',
      },
    };
  },
  created() {
    const currentUser = localStorage.getItem('currentUser');
    if (currentUser) this.currentUser = JSON.parse(currentUser);
  },
  methods: {
    login() {
      const currentUser = { ...this.currentUser };
      const { qq, nick } = currentUser;
      if (!qq) return this.$toast({ message: '请输入您的 QQ 号', forbidClick: true });
      if (!isQQ(qq)) return this.$toast({ message: '请输入正确的 QQ 号', forbidClick: true });
      if (!nick) return this.$toast({ message: '请输入您的昵称', forbidClick: true });
      if (nick.length > 6) return this.$toast({ message: '请输入正确的昵称', forbidClick: true });
      localStorage.setItem('currentUser', JSON.stringify(currentUser));
      this.$router.push('/live');
    },
  },
};
</script>

<style lang="less" scoped>
.login {
  &_head {
    display: flex;
    align-items: center;
    justify-content: center;
    height: 50px;
    background-color: #fff;
    box-shadow: 0 2px 10px 0 rgba(0, 0, 0, 0.1);
    color: #303133;
    text-shadow: 0 3px 3px rgba(0, 0, 0, 0.35);
    font-weight: 500;
    font-size: 18px;
    svg {
      width: 22px;
      margin-right: 5px;
    }
  }

  &_form {
    padding: 30px 24px;
    &__item {
      margin-bottom: 24px;
      &--label {
        color: #606266;
        margin-bottom: 12px;
      }
      &--value {
        width: 100%;
        height: 40px;
        border-radius: 4px;
        padding: 0 10px;
        transition: color 0.25s, border-color 0.25s;
        &:focus {
          color: #6c5ce7;
          border-color: #6c5ce7;
        }
      }
    }
  }
  &_submit {
    position: fixed;
    bottom: 24px;
    left: 24px;
    right: 24px;
    display: flex;
    align-items: center;
    justify-content: center;
    height: 45px;
    border-radius: 22.5px;
    color: #fff;
    font-size: 15px;
    font-weight: 500;
    background-color: #6c5ce7;
    box-shadow: 0 8px 12px #6c5ce780;
    cursor: pointer;
  }
}
</style>